Fberbari/Retrofrigeration-firmware/firmware/Drivers/esp8266/Src/esp82660.c
#include "esp8266.h"
#include "esp8266_config.h"
//#########################################################################################################
bool Wifi_SendRaw(uint8_t *data,uint16_t len)
{
	if(len <= _WIFI_TX_SIZE)
	{
		// Send the information in data through the UART of the ESP8266
		memcpy(Wifi.TxBuffer,data,len);
		if(HAL_UART_Transmit(&_WIFI_USART,data,len,900) == HAL_OK)
			return true;
		else
			return false;
	}
	else
		return false;
}
//#########################################################################################################
bool Wifi_SendString(char *data)
{
	return Wifi_SendRaw((uint8_t*)data,strlen(data));
}
//#########################################################################################################
bool Wifi_SendStringAndWait(char *data,uint16_t DelayUs)
{
	if(Wifi_SendRaw((uint8_t*)data,strlen(data))==false)
		return false;
	DWT_Delay_us(DelayUs);
	return true;
}
//#########################################################################################################
bool Wifi_WaitForString(uint32_t TimeOut_ms,uint8_t *result,uint8_t CountOfParameter,...)
{
	/*
	 * It uses the CountOfParameter and the Parameters after that to compare with the
	 * information that it was received in the UART RX. If the parameter is in the
	 * received string the functions return a true value and the position of the
	 * parameter (according to the position in the function)
	 *
	 * Ex:
	 * Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")
	 *
	 * If the ESP8266 return a AT+OK after the last command, the function is going to
	 * return a true value and the result number would be 1.
	 */

	if(result == NULL)
		return false;
	if(CountOfParameter == 0)
		return false;

	*result=0;

	va_list tag;
		va_start (tag,CountOfParameter);
		char *arg[CountOfParameter];
		for(uint8_t i=0; i<CountOfParameter ; i++)
			arg[i] = va_arg (tag, char *);
	va_end (tag);

	for(uint32_t t=0 ; t<TimeOut_ms ; t+=20)
	{
		DWT_Delay_us(20000);
		for(uint8_t	mx=0 ; mx<CountOfParameter ; mx++)
		{
			if(strstr((char*)Wifi.RxBuffer,arg[mx])!=NULL)
			{
				*result = mx+1;
				return true;
			}
		}
	}
	// timeout
	return false;

}
//#########################################################################################################
bool Wifi_ReturnString(char *result,uint8_t WantWhichOne,char *SplitterChars)
{
	if(result == NULL)
		return false;
	if(WantWhichOne==0)
		return false;

	char *str = (char*)Wifi.RxBuffer;


	str = strtok (str,SplitterChars);
	if(str == NULL)
	{
		strcpy(result,"");
		return false;
	}
	while (str != NULL)
  {
    str = strtok (NULL,SplitterChars);
		if(str != NULL)
			WantWhichOne--;
		if(WantWhichOne==0)
		{
			strcpy(result,str);
			return true;
		}
  }
	strcpy(result,"");
	return false;
}
//#########################################################################################################
bool Wifi_ReturnStrings(char *InputString,char *SplitterChars,uint8_t CountOfParameter,...)
{
	if(CountOfParameter == 0)
		return false;
	va_list tag;
		va_start (tag,CountOfParameter);
		char *arg[CountOfParameter];
		for(uint8_t i=0; i<CountOfParameter ; i++)
			arg[i] = va_arg (tag, char *);
	va_end (tag);

	char *str;
	str = strtok (InputString,SplitterChars);
	if(str == NULL)
		return false;
	uint8_t i=0;
	while (str != NULL)
  {
    str = strtok (NULL,SplitterChars);
		if(str != NULL)
			CountOfParameter--;
		strcpy(arg[i],str);
		i++;
		if(CountOfParameter==0)
		{
			return true;
		}
  }
	return false;

}
//#########################################################################################################
bool Wifi_ReturnInteger(int32_t	*result,uint8_t WantWhichOne,char *SplitterChars)
{
	if((char*)Wifi.RxBuffer == NULL)
		return false;
	if(Wifi_ReturnString((char*)Wifi.RxBuffer,WantWhichOne,SplitterChars)==false)
		return false;
	*result = atoi((char*)Wifi.RxBuffer);
	return true;
}
//#########################################################################################################

bool Wifi_ReturnFloat(float	*result,uint8_t WantWhichOne,char *SplitterChars)
{
	if((char*)Wifi.RxBuffer == NULL)
		return false;
	if(Wifi_ReturnString((char*)Wifi.RxBuffer,WantWhichOne,SplitterChars)==false)
		return false;
	*result = atof((char*)Wifi.RxBuffer);
	return true;
}
//#########################################################################################################
void Wifi_RemoveChar(char *str, char garbage)
{
	char *src, *dst;
  for (src = dst = str; *src != '\0'; src++)
	{
		*dst = *src;
		if (*dst != garbage)
			dst++;
  }
  *dst = '\0';
}
//#########################################################################################################
void Wifi_RxClear(void)
{
	memset(Wifi.RxBuffer,0,_WIFI_RX_SIZE);
	Wifi.RxIndex=0;
	HAL_UART_Receive_IT(&_WIFI_USART,&Wifi.usartBuff,1);
}
//#########################################################################################################
void Wifi_TxClear(void)
{
	memset(Wifi.TxBuffer,0,_WIFI_TX_SIZE);
}
//#########################################################################################################
void Wifi_RxCallBack(void)
{
	Wifi.RxBuffer[Wifi.RxIndex] = Wifi.usartBuff;
	if(Wifi.RxIndex < _WIFI_RX_SIZE)
	  Wifi.RxIndex++;
	HAL_UART_Receive_IT(&_WIFI_USART,&Wifi.usartBuff,1);
}
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
bool Wifi_Init(void)
{
	uint8_t result;
	bool returnVal=false;
	// Clean the variables and start the interruption to work with the UART
	do
	{
		Wifi_RxClear();

		if(Wifi_SendString("AT\r\n")==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;
		if(result==2)
			break;
		returnVal = true;
		Wifi_RxClear();
		Wifi_TxClear();
		HAL_UART_Receive_IT(&_WIFI_USART,&Wifi.usartBuff,1);
	}while(0);
	return returnVal;
}
//#########################################################################################################
// void Wifi_Enable(void){
// 	// It is necessary to set HIGH both pins of the module to work correctly
// 	HAL_GPIO_WritePin (_BANK_WIFI_BUTTONS,_BUTTON_ENABLE, GPIO_PIN_RESET);
// 	HAL_GPIO_WritePin (_BANK_WIFI_BUTTONS,_BUTTON_RST, GPIO_PIN_RESET);
// 	DWT_Delay_us(100);
// 	HAL_GPIO_WritePin (_BANK_WIFI_BUTTONS,_BUTTON_ENABLE, GPIO_PIN_SET);
// 	HAL_GPIO_WritePin (_BANK_WIFI_BUTTONS,_BUTTON_RST, GPIO_PIN_SET);
// 	HAL_Delay(2000);
// }
//#########################################################################################################
// void Wifi_Disable(void){
// 	// It is necessary to set LOW both pins of the module to disable correctly
// 	HAL_GPIO_WritePin (_BANK_WIFI_BUTTONS,_BUTTON_ENABLE, GPIO_PIN_SET);
// 	HAL_GPIO_WritePin (_BANK_WIFI_BUTTONS,_BUTTON_RST, GPIO_PIN_SET);
// 	DWT_Delay_us(100);
// 	HAL_GPIO_WritePin (_BANK_WIFI_BUTTONS,_BUTTON_ENABLE, GPIO_PIN_RESET);
// 	HAL_GPIO_WritePin (_BANK_WIFI_BUTTONS,_BUTTON_RST, GPIO_PIN_RESET);
// }
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
bool	Wifi_Restart(void)
{
	// Make a restart of the ESP8266 using the AT Commands

	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+RST\r\n");
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
// bool	Wifi_DeepSleep(uint16_t DelayMs)
// {
// 	// The ESP8266 enters in Deep-Sleep Mode for the time, which is indicated
//
// 	uint8_t result;
// 	bool	returnVal=false;
// 	do
// 	{
// 		Wifi_RxClear();
// 		sprintf((char*)Wifi.TxBuffer,"AT+GSLP=%d\r\n",DelayMs);
// 		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
// 			break;
// 		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
// 			break;			// The timeout was completed and the string was not there
// 		if(result == 2)		// It was find the "ERROR" String in the receiving information
// 			break;
// 		returnVal=true;
// 	}while(0);
// 	return returnVal;
// }
//#########################################################################################################
// bool	Wifi_FactoryReset(void)
// {
// 	uint8_t result;
// 	bool	returnVal=false;
// 	do
// 	{
// 		Wifi_RxClear();
// 		sprintf((char*)Wifi.TxBuffer,"AT+RESTORE\r\n");
// 		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
// 			break;
// 		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
// 			break;			// The timeout was completed and the string was not there
// 		if(result == 2)		// It was find the "ERROR" String in the receiving information
// 			break;
// 		returnVal=true;
// 	}while(0);
// 	return returnVal;
// }
//#########################################################################################################
// bool	Wifi_Update(void)
// {
// 	// Update the version of AT Commands when the device is connected to Internet
//
// 	uint8_t result;
// 	bool	returnVal=false;
// 	do
// 	{
// 		Wifi_RxClear();
// 		sprintf((char*)Wifi.TxBuffer,"AT+CIUPDATE\r\n");
// 		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
// 			break;
// 		if(Wifi_WaitForString(1000*60*5,&result,2,"OK","ERROR")==false)
// 			break;			// The timeout was completed and the string was not there
// 		if(result == 2)		// It was find the "ERROR" String in the receiving information
// 			break;
// 		returnVal=true;
// 	}while(0);
// 	return returnVal;
// }
//#########################################################################################################
// bool	Wifi_SetRfPower(uint8_t Power_0_to_82)
// {
// 	uint8_t result;
// 	bool	returnVal=false;
// 	do
// 	{
// 		Wifi_RxClear();
// 		sprintf((char*)Wifi.TxBuffer,"AT+RFPOWER=%d\r\n",Power_0_to_82);
// 		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
// 			break;
// 		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
// 			break;			// The timeout was completed and the string was not there
// 		if(result == 2)		// It was find the "ERROR" String in the receiving information
// 			break;
// 		returnVal=true;
// 	}while(0);
// 	return returnVal;
// }
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
bool	Wifi_SetMode(WifiMode_t	WifiMode_)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+CWMODE_CUR=%d\r\n",WifiMode_);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		Wifi.Mode = WifiMode_;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
bool	Wifi_GetMode(void)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+CWMODE_CUR?\r\n");
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;

		if(Wifi_ReturnInteger((int32_t*)&result,1,":"))
			Wifi.Mode = (WifiMode_t)result ;
		else
			Wifi.Mode = WifiMode_Error;
		returnVal=true;
	}while(0);
	return returnVal;
}
bool	Wifi_GetMyIp(void)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+CIFSR\r\n");
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		sscanf((char*)Wifi.RxBuffer,"AT+CIFSR\r\r\n+CIFSR:APIP,\"%[^\"]",Wifi.MyIP);
		sscanf((char*)Wifi.RxBuffer,"AT+CIFSR\r\r\n+CIFSR:STAIP,\"%[^\"]",Wifi.MyIP);
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
bool	Wifi_Station_ConnectToAp(char *SSID,char *Pass,char *MAC)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		/*
		 * It connects to a WiFi network who has all the parameters correctly
		 */
		Wifi_RxClear();
		if(MAC==NULL)
			sprintf((char*)Wifi.TxBuffer,"AT+CWJAP_CUR=\"%s\",\"%s\"\r\n",SSID,Pass);
		else
			sprintf((char*)Wifi.TxBuffer,"AT+CWJAP_CUR=\"%s\",\"%s\",\"%s\"\r\n",SSID,Pass,MAC);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_VERYHIGH,&result,3,"\r\nOK\r\n","\r\nERROR\r\n","\r\nFAIL\r\n")==false)
			break;
		if(result > 1)		// If the result is higher to 1 is because there were an error
			break;			// in the communication
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
// bool	Wifi_Station_Disconnect(void)
// {
// 	uint8_t result;
// 	bool		returnVal=false;
// 	do
// 	{
// 		Wifi_RxClear();
// 		sprintf((char*)Wifi.TxBuffer,"AT+CWQAP\r\n");
// 		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
// 			break;
// 		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
// 			break;			// The timeout was completed and the string was not there
// 		if(result == 2)		// It was find the "ERROR" String in the receiving information
// 			break;
// 		returnVal=true;
// 	}while(0);
// 	return returnVal;
// }
//#########################################################################################################
bool	Wifi_Station_SetIp(char *IP,char *GateWay,char *NetMask)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+CIPSTA_CUR=\"%s\",\"%s\",\"%s\"\r\n",IP,GateWay,NetMask);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		Wifi.StationDhcp=false;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
bool	Wifi_Station_DhcpEnable(bool Enable)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		/*
		 * It makes the DHCP from the Station Mode enable
		 */
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+CWDHCP_CUR=1,%d\r\n",Enable);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		Wifi.StationDhcp=Enable;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
bool	Wifi_Station_DhcpIsEnable(void)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		/*
		 * It makes a question to the micro-controller to know how is the status of the
		 * DHCP process inside of it
		 */
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+CWDHCP_CUR?\r\n");
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		if(Wifi_ReturnInteger((int32_t*)&result,1,":")==false)
			break;			// It searches for a ':' Character to know
							// the next integer value after that
		switch(result)
		{
			case 0:
				Wifi.StationDhcp=false;
				Wifi.SoftApDhcp=false;
			break;
			case 1:
				Wifi.StationDhcp=false;
				Wifi.SoftApDhcp=true;
			break;
			case 2:
				Wifi.StationDhcp=true;
				Wifi.SoftApDhcp=false;
			break;
			case 3:
				Wifi.StationDhcp=true;
				Wifi.SoftApDhcp=true;
			break;
		}
		returnVal=true;
	}while(0);	return returnVal;
}
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
bool  Wifi_SoftAp_Create(char *SSID,char *password,uint8_t channel,WifiEncryptionType_t WifiEncryptionType,uint8_t MaxConnections_1_to_4,bool HiddenSSID)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		/*
		 * It creates the SoftAP (Small WiFi Network) that it is possible with the ESP8266
		 * the data of this network is defined by the inputs of the function
		 */
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+CWSAP=\"%s\",\"%s\",%d,%d,%d,%d\r\n",SSID,password,channel,WifiEncryptionType,MaxConnections_1_to_4,HiddenSSID);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;

		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
bool Wifi_GetApConnection(void){
	bool returnVal = false;
	uint8_t result;
	do
	{
		Wifi_RxClear();
		// Get the name of the AP Connection
		sprintf((char*)Wifi.TxBuffer,"AT+CWJAP_CUR?\r\n");
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		/*
		 * The previous AT Command has a response like the next example:
		 * 			AT+CWJAP_CUR?
		 * 			+CWJAP_CUR:<ssid>,<bssid>,<channel>,<rssi>
		 * 			OK
		 * The previous function checks the OK Response and the next lines search for the
		 * information of the SSID, taking in count the position of that information in
		 * the string. It uses pointers to get the start and the final position and the
		 * value is saved in the structure of the Wifi Connection.
		 */

		char *str1 = strstr((char*)Wifi.RxBuffer,":\"");
		if(str1==NULL){
			str1 = strstr((char*)Wifi.RxBuffer,"No AP");
			if(str1 == NULL)
				break;
			else{
				memset(Wifi.SSID_Connected, (uint8_t)'\0', 20);
				returnVal = true;
			}
		}
		else
		{
			str1 = str1+2;
			char *str2 = strstr(str1,"\"");
			size_t len = str2-str1;
			strncpy(Wifi.SSID_Connected, str1, len);
			Wifi.SSID_Connected[len] = '\0';
			returnVal=true;
		}
	}while(0);

	return returnVal;
}

