Fberbari/Retrofrigeration-firmware/firmware/Drivers/esp8266/Src/esp82660.c
//#########################################################################################################
// bool  Wifi_SoftAp_GetConnectedDevices(void)
// {
// 	uint8_t result;
// 	bool	returnVal=false;
// 	do
// 	{
// 		/*
// 		 * The ESP8266 has the possibility to have in a SoftAP (Small WiFi Network) four
// 		 * devices connected at the same time. This function save the information about
// 		 * the devices, which is the IP address and the MAC Address of every device
// 		 */
// 		Wifi_RxClear();
// 		sprintf((char*)Wifi.TxBuffer,"AT+CWLIF\r\n");
// 		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
// 			break;
// 		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
// 			break;			// The timeout was completed and the string was not there
// 		if(result == 2)		// It was find the "ERROR" String in the receiving information
// 			break;
//
// 		Wifi_RemoveChar((char*)Wifi.RxBuffer,'\r');
// 		Wifi_ReturnStrings((char*)Wifi.RxBuffer,"\n,",10,Wifi.SoftApConnectedDevicesIp[0],Wifi.SoftApConnectedDevicesMac[0],Wifi.SoftApConnectedDevicesIp[1],Wifi.SoftApConnectedDevicesMac[1],Wifi.SoftApConnectedDevicesIp[2],Wifi.SoftApConnectedDevicesMac[2],Wifi.SoftApConnectedDevicesIp[3],Wifi.SoftApConnectedDevicesMac[3],Wifi.SoftApConnectedDevicesIp[4],Wifi.SoftApConnectedDevicesMac[4]);
//
// 		// Search if there is any device or it does not have any
// 		for(uint8_t i=0 ; i<6 ; i++)
// 		{
// 		  if( (Wifi.SoftApConnectedDevicesIp[i][0]<'0') || (Wifi.SoftApConnectedDevicesIp[i][0]>'9'))
// 			Wifi.SoftApConnectedDevicesIp[i][0]=0;
// 		  if( (Wifi.SoftApConnectedDevicesMac[i][0]<'0') || (Wifi.SoftApConnectedDevicesMac[i][0]>'9'))
// 			Wifi.SoftApConnectedDevicesMac[i][0]=0;
// 		}
//
// 		returnVal=true;
// 	}while(0);
// 	return returnVal;
// }
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
//#########################################################################################################
bool  Wifi_TcpIp_GetConnectionStatus(void)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		// Get the connections status of all the possible connection with the ESP8266
		sprintf((char*)Wifi.TxBuffer,"AT+CIPSTATUS\r\n");
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		/*
		 * it searches for the string STATUS: to know what is the status of the connection
		 * and save this information in the different variables of the structure. The ESP8266
		 * has five possible connection at the same time, therefore it uses a for to save
		 * all the needed information in the structure. If there are not other connection
		 * the str return a NULL value and the loop is broken.
		 */
		char *str = strstr((char*)Wifi.RxBuffer,"\nSTATUS:");
		if(str==NULL)
		  break;
		str = strchr(str,':');
		str++;
		for(uint8_t i=0 ; i<5 ;i++)
		  Wifi.TcpIpConnections[i].status=(WifiConnectionStatus_t)atoi(str);
		str = strstr((char*)Wifi.RxBuffer,"+CIPSTATUS:");
		for(uint8_t i=0 ; i<5 ;i++)
		{
		  sscanf(str,"+CIPSTATUS:%d,\"%3s\",\"%[^\"]\",%d,%d,%d",(int*)&Wifi.TcpIpConnections[i].LinkId,Wifi.TcpIpConnections[i].Type,Wifi.TcpIpConnections[i].RemoteIp,(int*)&Wifi.TcpIpConnections[i].RemotePort,(int*)&Wifi.TcpIpConnections[i].LocalPort,(int*)&Wifi.TcpIpConnections[i].RunAsServer);
		  str++;
		  str = strstr(str,"+CIPSTATUS:");
		  if(str==NULL)
			break;
		}
		returnVal=true;

	}while(0);
	return returnVal;
}
//#########################################################################################################
bool  Wifi_TcpIp_Ping(char *PingTo)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+PING=\"%s\"\r\n",PingTo);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_MED,&result,3,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
    if(Wifi_ReturnInteger((int32_t*)&Wifi.TcpIpPingAnswer,2,"+")==false)
      break;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
bool  Wifi_TcpIp_SetMultiConnection(bool EnableMultiConnections)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		// Enable or Disable the multiconnection possibility
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+CIPMUX=%d\r\n",EnableMultiConnections);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;
		if(result == 2)
			break;
    Wifi.TcpIpMultiConnection=EnableMultiConnections;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
bool  Wifi_TcpIp_GetMultiConnection(void)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+CIPMUX?\r\n");
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
    if(Wifi_ReturnInteger((int32_t*)&result,1,":")==false)
      break;
    Wifi.TcpIpMultiConnection=(bool)result;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
bool  Wifi_TcpIp_StartTcpConnection(uint8_t LinkId,char *RemoteIp,uint16_t RemotePort,uint16_t TimeOut)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		/*
		 * It makes a TCP server and then it creates a TCP Connection according to the
		 * settings in the function. It uses a very high time of waiting because the
		 * ESP8266 takes a lot of time to create a connection with a TCP the first time.
		 */
		Wifi_RxClear();
		if(Wifi.TcpIpMultiConnection==true){
			sprintf((char*)Wifi.TxBuffer,"AT+CIPSERVER=1,%d\r\n",RemotePort);
			if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
				break;
			if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
				break;			// The timeout was completed and the string was not there
			if(result == 2)		// It was find the "ERROR" String in the receiving information
				break;
		}
		Wifi_RxClear();
		if(Wifi.TcpIpMultiConnection==false)
		  sprintf((char*)Wifi.TxBuffer,"AT+CIPSTART=\"TCP\",\"%s\",%d,%d\r\n",RemoteIp,RemotePort,TimeOut);
		else
		  sprintf((char*)Wifi.TxBuffer,"AT+CIPSTART=%d,\"TCP\",\"%s\",%d,%d\r\n",LinkId,RemoteIp,RemotePort,TimeOut);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_HIGH,&result,3,"OK","CONNECT","ERROR")==false)
			break;
		if(result == 3)
			break;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
// bool  Wifi_TcpIp_StartUdpConnection(uint8_t LinkId,char *RemoteIp,uint16_t RemotePort,uint16_t LocalPort)
// {
// 	uint8_t result;
// 	bool	returnVal=false;
// 	do
// 	{
// 		Wifi_RxClear();
// 		if(Wifi.TcpIpMultiConnection==false)
// 		  sprintf((char*)Wifi.TxBuffer,"AT+CIPSTART=\"UDP\",\"%s\",%d,%d\r\n",RemoteIp,RemotePort,LocalPort);
// 		else
// 		  sprintf((char*)Wifi.TxBuffer,"AT+CIPSTART=%d,\"UDP\",\"%s\",%d,%d\r\n",LinkId,RemoteIp,RemotePort,LocalPort);
// 		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
// 			break;
// 		if(Wifi_WaitForString(_WIFI_WAIT_TIME_HIGH,&result,3,"OK","ALREADY","ERROR")==false)
// 			break;
// 		if(result == 3)		// If the RX String returns a ERROR the function breaks and
// 			break;			// send a false
// 		returnVal=true;
// 	}while(0);
// 	return returnVal;
// }
//#########################################################################################################
bool  Wifi_TcpIp_Close(uint8_t LinkId)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		if(Wifi.TcpIpMultiConnection==false)
		  sprintf((char*)Wifi.TxBuffer,"AT+CIPCLOSE\r\n");
		else
		  sprintf((char*)Wifi.TxBuffer,"AT+CIPCLOSE=%d\r\n",LinkId);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
bool  Wifi_TcpIp_SetEnableTcpServer(uint16_t PortNumber)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		if(Wifi.TcpIpMultiConnection==false)
		{
			// it actives the Multiconnection first to make a TCP Server
			sprintf((char*)Wifi.TxBuffer,"AT+CIPMUX=1\r\n");
			if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
				break;
			if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
				break;			// The timeout was completed and the string was not there
			if(result == 2)		// It was find the "ERROR" String in the receiving information
				break;
			Wifi.TcpIpMultiConnection=true;
			Wifi_RxClear();
		}
		else
		  sprintf((char*)Wifi.TxBuffer,"AT+CIPSERVER=1,%d\r\n",PortNumber);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
bool  Wifi_TcpIp_SetDisableTcpServer(uint16_t PortNumber)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		sprintf((char*)Wifi.TxBuffer,"AT+CIPSERVER=0,%d\r\n",PortNumber);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;			// The timeout was completed and the string was not there
		if(result == 2)		// It was find the "ERROR" String in the receiving information
			break;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
// bool  Wifi_TcpIp_SendDataUdp(uint8_t LinkId,uint16_t dataLen,uint8_t *data)
// {
// 	uint8_t result;
// 	bool	returnVal=false;
// 	do
// 	{
// 		Wifi_RxClear();
// 		if(Wifi.TcpIpMultiConnection==false)
// 			sprintf((char*)Wifi.TxBuffer,"AT+CIPSEND=%d\r\n",dataLen);
// 		else
// 			sprintf((char*)Wifi.TxBuffer,"AT+CIPSEND=%d,%d\r\n",LinkId,dataLen);
// 		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
// 			break;
// 		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,">","ERROR")==false)
// 			break;			// The timeout was completed and the string was not there
// 		if(result == 2)		// It was find the "ERROR" String in the receiving information
// 			break;
// 		Wifi_RxClear();
// 		// Send in this time the information through the connection
// 		Wifi_SendRaw(data,dataLen);
// 		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
// 			break;			// The timeout was completed and the string was not there
// 		if(result == 2)		// It was find the "ERROR" String in the receiving information
// 			break;
// 		returnVal=true;
// 	}while(0);
// 	return returnVal;
//
// }
//#########################################################################################################
bool  Wifi_TcpIp_SendDataTcp(uint8_t LinkId,uint16_t dataLen,uint8_t *data)
{
	uint8_t result;
	bool	returnVal=false;
	do
	{
		Wifi_RxClear();
		if(Wifi.TcpIpMultiConnection==false)
			sprintf((char*)Wifi.TxBuffer,"AT+CIPSENDBUF=%d\r\n",dataLen);
		else
			sprintf((char*)Wifi.TxBuffer,"AT+CIPSENDBUF=%d,%d\r\n",LinkId,dataLen);
		if(Wifi_SendString((char*)Wifi.TxBuffer)==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,3,">","ERROR","busy")==false)
			break;
		if(result > 1)
			break;
		Wifi_RxClear();
		Wifi_SendRaw(data,dataLen);
		if(Wifi_WaitForString(_WIFI_WAIT_TIME_LOW,&result,2,"OK","ERROR")==false)
			break;
		returnVal=true;
	}while(0);
	return returnVal;
}
//#########################################################################################################
